In [1]:
import pandas as pd
import numpy as np 
from pandas import DataFrame, Series

In [6]:
ser=Series([1,2,3,4,1,2,3,4])

In [7]:
ser

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [8]:
ser.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [10]:
ser.replace([1,3],[100,300])

0    100
1      2
2    300
3      4
4    100
5      2
6    300
7      4
dtype: int64

In [11]:
ser.replace({1:100,3:300})

0    100
1      2
2    300
3      4
4    100
5      2
6    300
7      4
dtype: int64

In [16]:
dframe=DataFrame(np.arange(12).reshape(3,4),
                index=pd.Index(["SF","LA","NY"],name="Cities"),
                columns=list("ABCD") 
                )

In [17]:
dframe

        A  B   C   D
Cities
SF      0  1   2   3
LA      4  5   6   7
NY      8  9  10  11

In [18]:
dframe.columns.map(str.lower)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
dframe.rename(index=str.title,columns=str.lower)

        a  b   c   d
Cities
Sf      0  1   2   3
La      4  5   6   7
Ny      8  9  10  11

In [22]:
dframe.rename(index={"NY":"New York", "LA":"Los Anegeles"},columns={"A":"Alpha"},inplace=True)

In [23]:
dframe

              Alpha  B   C   D
Cities
SF                0  1   2   3
Los Anegeles      4  5   6   7
New York          8  9  10  11

In [24]:
years=[1992,1993,1994,1999,2002,2010,2012,2015,1986,1974,1956]
decades=[1950,1960,1970,1980,1990,2000,2010,2020]

In [26]:
pd.cut(years,decades).value_counts()

(1950, 1960]    1
(1960, 1970]    0
(1970, 1980]    1
(1980, 1990]    1
(1990, 2000]    4
(2000, 2010]    2
(2010, 2020]    2
dtype: int64

In [28]:
pd.cut(years,decades).categories

IntervalIndex([(1950, 1960], (1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]]
              closed='right',
              dtype='interval[int64]')

In [29]:
pd.cut(years,3,precision=1).value_counts()

(1955.9, 1975.7]    2
(1975.7, 1995.3]    4
(1995.3, 2015.0]    5
dtype: int64

In [30]:
np.random.seed(12345)
dframe=DataFrame(np.random.randn(1000,4))

In [32]:
dframe.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [36]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [43]:
dframe[(np.abs(dframe)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [33]:
col=dframe[0]

In [34]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

In [62]:
dframe[np.abs(dframe)>2.5] = np.sign(dframe) * 3

In [63]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.068013     0.071058     0.023111    -0.000762
std       0.995272     0.993983     0.991789     0.983268
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     3.000000     3.000000     3.000000

In [67]:
preumtat =DataFrame(np.arange(16).reshape(4,4))
shaker=np.random.permutation(4)
preumtat.take(shaker,axis=1)

    1   3   0   2
0   1   3   0   2
1   5   7   4   6
2   9  11   8  10
3  13  15  12  14

In [69]:
box=np.array([1,2,3])
blender=np.random.randint(0,len(box),size=10)
box.take(blender)

array([1, 1, 3, 2, 2, 3, 2, 2, 1, 2])